---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.LoadSummaryDemandFactorLabel
source: html/369f3896-80ec-fbe0-4d7b-72e27ff29ffa.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.LoadSummaryDemandFactorLabel Property

The name template for the demand factor parameter of the load classification.

## Syntax (C#)
```csharp
public string LoadSummaryDemandFactorLabel { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: loadSummaryDemandFactorLabel is not a valid globalization format string.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null